Website/app/controllers/forms_controller.rb

	def show
    @user = User.find(params[:user_id])
    @form = @user.forms.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = ? AND "forms"."id" = ? LIMIT 1  [["user_id", 4], ["id", 1]]

  def create
    @user = User.find(params[:user_id])
    @form = @user.forms.create(form_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "forms" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["user_id", 4], ["created_at", "2015-05-01 13:59:11.614019"], ["updated_at", "2015-05-01 13:59:11.614019"]]

  def update
    @user = User.find(params[:user_id])
    @form = @user.forms.find(params[:id])

    if @form.update(form_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = ? AND "forms"."id" = ? LIMIT 1  [["user_id", 4], ["id", 1]]
UPDATE "forms" SET "content" = ?, "updated_at" = ? WHERE "forms"."id" = ?  [["content", "asdfsadfa|#|"], ["updated_at", "2015-05-01 17:02:32.824115"], ["id", 5]]

  def view_responses
    @user = User.find(params[:user_id])
    @form = @user.forms.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = ? AND "forms"."id" = ? LIMIT 1  [["user_id", 4], ["id", 1]]