Website/app/controllers/responses_controller.rb

SELECT  "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT 1  [["id", 1]]
---
	def new
		@form = Form.find(params[:fid])

SELECT  "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT 1  [["id", 0]]
INSERT INTO "responses" ("questions", "response", "form_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["questions", "asdfasdfas|#|"], ["response", "asfsadf|#|"], ["form_id", 6], ["created_at", "2015-05-01 21:30:53.676516"], ["updated_at", "2015-05-01 21:30:53.676516"]]
---
	def create
		@form = Form.find(params[:fid])
		@response = @form.responses.create(response_params)