Website/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def search
    @client = get_dropbox_client
    unless @client
        redirect_to(:action => 'auth_start') and return
    end
    begin
      session[:query1] = params[:query]
      if session[:query1] == "Please enter a value"
        session[:query1] = nil
      end
      @user = User.find_by(id: session['user_id'])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def dropbox_change
    @client = get_dropbox_client
    unless @client
        redirect_to(:action => 'auth_start') and return
    end
    x = params[:path]
    @metadata = @client.metadata(params[:path])
    #render :text => "#{@metadata}"
    @user = User.find_by(id: session['user_id'])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def upload
    @client = get_dropbox_client
    unless @client
        redirect_to(:action => 'auth_start') and return
    end
    begin
        # Upload the POST'd file to Dropbox, keeping the same name
        resp = @client.put_file("#{session[:lol2]}/#{params[:file].original_filename}", params[:file].read)
        #render :text => "Upload successful.  File now at #{resp['path']}"
        flash[:success] = "Upload successful.  File now at #{resp['path']}"
    rescue DropboxAuthError => e
        session.delete(:access_token)  # An auth error means the access token is probably bad
        logger.info "Dropbox auth error: #{e}"
        #render :text => "Dropbox auth error"
        flash[:danger] = "Dropbox auth error"
    rescue DropboxError => e
        logger.info "Dropbox API error: #{e}"
        #render :text => "Dropbox API error"
        flash[:danger] = "Dropbox API error"
    end
    session[:lol] = session[:lol2]
    @user = User.find_by(id: session['user_id'])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @@class_user = @user
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    def auth_finish
        begin
            access_token, user_id, url_state = get_web_auth.finish(params)
            session[:access_token] = access_token
            @user = User.find_by(id: session['user_id'])