Website/app/views/users/show.html.erb

SELECT "forms".* FROM "forms" WHERE "forms"."user_id" = ?  [[nil, 4]]
---
		<ul class="list-group">
			<% @user.forms.each do |form| %>